app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "d191ARA3xmS9-ASZtTsRqA"], ["updated_at", "2019-08-06 20:56:04.149741"], ["id", 1]]

    def self.find_by_credentials(email, password)
        user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mary@gmail.com"], ["LIMIT", 1]]